---
type: HostObject
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# HostObject

`Autodesk.Revit.DB.HostObject` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | FindInserts | — | `public IList < ElementId > FindInserts ( bool addRectOpenings , bool includeShadows , bool includeEmbeddedWalls , bool includeSharedEmbeddedInserts )` |
| Property | Parameter | — | `` |